# Create a CSV file from pandas dataframe

In [2]:
import pandas as pd

In [4]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
    'Grades':['AA','AB','AA','AB','AC','BA','BB']
}

df_student = pd.DataFrame(students_score)

df_student

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AB
4    Paxton     90     AC
5   Madison     83     BA
6    Aurora     82     BB

In [5]:
df_student.to_csv('students_score.csv')

In [6]:
pwd

'/Users/robertmodalo/Documents/programming/python/data_analysis-data_thinkers/dt-pandas-tutorial'

In [7]:
df_student.to_csv('students_score_no_index.csv', index=False)

In [14]:
df_student_2 = pd.read_csv("students_score_no_index.csv")

df_student_2

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AB
4    Paxton     90     AC
5   Madison     83     BA
6    Aurora     82     BB